cask_args appdir: '/Applications'

# vim: syntax=ruby filetype=ruby

# Lets us do `brew services restart postgres`, etc
tap 'homebrew/services'

# Old versions of some packages
tap 'homebrew/versions'

tap 'homebrew/bundle'

brew 'coreutils'

# The recommended way to use Heroku
brew 'heroku'

# Use version 3.4+ for colorful diffs with --color
brew 'diffutils'

# so :Rtags works
brew 'ctags'

# My favorite editor
brew 'vim'

# Fast GitHub client, used in git-create-pull-request
brew 'hub'

# Don't install completions, in favor of using Zsh's (better) git completions
brew 'git', args: ['--without-completions']

# Fuzzy finder
brew 'fzf'

# thoughtbot stuff like rcm
tap 'thoughtbot/formulae'
brew 'rcm'
brew 'parity'

# Fast, hip replacement for grep
brew 'ripgrep'

# https://tldr.sh/
# Man pages, but with practical examples.
brew 'tldr'

# asdf version manager: https://github.com/asdf-vm/asdf
brew 'asdf'

# cat, but smarter
brew 'bat'

# Mac App Store command line interface https://github.com/mas-cli/mas
brew 'mas'
